/**
 * Created by dingcj on 2017/11/3.
 */
package com.preset.createRole.vo {
import globals.PlatformSDK;

import net.consts.StaticConfig;

public class RandomName {

    /**正常版本**/
    private static var SURNAME:String = "支|贲|慕|太叔|诸|孙|乔|柳|卜|李|燕|叶|顾|周|牧|唐|穆|郑|侯|吕|包|宋|欧阳|堪|庞|皇甫|汪|陈|上官|祁|卫|宁|陶|崔|郦|司空|屈|沈|祖|柏|钮|颜|长孙|董|杨|轩辕|粱|秦|闾丘|罗|何|东郭|席|施|令狐|阎|孔|淳于|贾|魏|南宫|江|戚|百里|黎|谢|单于|鄂|温|汤|家|凌|滕|封|霍|聂|宓|虞|廉|符|柯|毕|刘|莫|郝|鲁|阳佟|咎|韦|归海|管|苗|安|吴|西门|经|任|左丘|房|袁|伯赏|裘|向|赫|裴|连|纪|陆|齐|骆|翁|伍|车|段";
    //男
    private static var MALE:String = "邑|绯|豪英|一笑|蹇|酬海|冥幽|紊|臻|忘幽|山河|鞯|严青|中道|嵩|鹤|成风|一斩|烙|不可|道消|裘|霸|无施|无剑|惮|无声|断天|雍|百招|不尤|瑛|匕|若风|一刀|靖|随阴|断秋|霆|一手|断缘|驳|捕|亿先|万声|隶|三德|剑心|威|悲|人英|送终|翎|老九|剑封|誉|储|人雄|绝义|擎|老四|绝悟|凛|汲|成威|万仇|丑|如豹|乘风|卿|糜|不评|万恶|耷|似狮|世开|焱|井|广山|灭龙|函|定帮|远锋|契|乌|追命|无敌|遥|大有|远山|鸿|奎|难破|行天|嚣|自中|天与|鹰|班|难胜|天寿|仰|德地|无血|伊|德天|聋五|筮|羊青|如花|勒|牛青|文龙|穆|开山|元正|扬|天德|浩阑|垣|铁身|士晋|师|老黑|铸海|翼|半邪|人龙|秋|半山|伯云|傥|一江|老头|乞|十八|剑通|俊驰|烨磊|天佑|修洁|远航|鸿韬|荣轩|浩宇|皓轩|擎宇|子轩|弘文|楷瑞|晋鹏|绍辉|鑫磊|昊强|博超|子骞|炎彬|越彬|靖琪|伟诚|健柏|峻夕|煜城|烨伟|伟泽|鸿煊|烨霖|煜祺|正豪|立诚|立辉|天思|鹏笑|强炫|松思|渊思|天宇|文轩|振家|晓博|昊焱|金鑫|鹏飞|思远|语堂|问旋|问筠|半雪|谷雪|代桃|盼秋|慕蕊|初晴|幼旋|沛山|觅松|冷安|醉薇|凡梦|念波|青寒|问安|友绿|诗云|寄灵|水云|谷波|妙海|从安|之玉|秋白|南风|初彤|映波|寻菡|芷烟|怜烟|觅云";
    //女
    private static var FEMALE:String = "莹|鸣凤|茗|嫣|千愁|敏|芫|稚晴|莆|凤|英姑|姝|珠|若颜|涟妖|萤|素阴|藏鸟|桐|竺|妙芹|若魔|瑛|灭男|嫣娆|芷|翠|如雪|艳血|芙|妖丽|菲音|茈|柔|茗茗|血茗|湘|代男|如娆|秀|芹|赛凤|若血|香|芙蓉|一曲|青|珊|艳一|冰姬|灵|东蒽|宫苴|绫|沉鱼|涔雨|惠|葶|不弱|老姆|丝|凡英|莫茗|筝|赛君|莫英|真|闭月|朝雪|贞|羞花|老太|珍|不愁|茹嫣|宛|盛男|丹妗|娩|青荷|缘郡|莞|清涟|冥茗|菀|一兰|溪灵|素|如花|惋清|愫|聋五|太英|涑|绣连|太清|兰|金连|善斓|澜|大凄|善愁|蓝|傻姑|善若|斓|蛟凤|嫣然|纹|莹芝|阑悦|雯|中蓝|阑香|若|婷冉|一凤|秋尽|芸遥|颜|凤灵|行云|艳|舞仙|雁|问晴|晓晓|之桃|尔岚|沛菡|曼文|惜文|新柔|海安|涵柏|醉蓝|从彤|语兰|碧彤|怜梦|妙彤|南莲|雨寒|如萱|寻真|向珊|以蕊|雪柳|凝天|寒云|宛儿";

    /**剑指蜀山版本**/
    private static var SURNAME_JIAN:String = "赵|孙|周|郑|冯|褚|蒋|韩|朱|尤|何|施|孔|严|金|陶|戚|邹|柏|窦|云|潘|奚|彭|鲁|昌|苗|花|俞|袁|酆|史|费|岑|雷|倪|滕|罗|郝|安|乐|时|皮|齐|伍|元|顾|平|和|萧|姚|湛|祁|禹|米|明|计|成|谈|茅|庞|纪|屈|祝|梁|阮|闵|季|强|路|危|童|郭|盛|刁|徐|骆|夏|田|胡|霍|万|柯|管|莫|房|缪|解|宗|宣|邓|单|洪|诸|石|吉|龚|嵇|滑|陆|翁|羊|惠|曲|封|羿|靳|邴|松|段|巫|焦|弓|隗|谷|侯|蓬|郗|仰|仲|宫|仇|暴|钭|戎|武|刘|詹|龙|幸|韶|黎|溥|宿|怀|邰|鄂|咸|赖|蔺|蒙|乔|郁|能|双|莘|翟|贡|逄|申|堵|宰|雍|璩|桂|牛|通|扈|冀|尚|温|庄|柴|阎|慕|茹|宦|鱼|向|易|戈|庾|暨|衡|都|满|匡|文|广|阙|欧|沃|蔚|夔|师|厍|晁|敖|冷|辛|那|饶|曾|沙|养|须|巢|蒯|查|荆|游|竺|逯|益|公|督|帅|亢|郈|琴|海|楚|法|鄢|钦|牟|佴|赏|哈|篁|爱|佟|福|火|迟|官|真|繁|祭|敬|舜|疏|浑|胶|高|原|练|仓|蹇|阿|恽|綦|仪|介|木|狐|虎|抗|杞|折|庆|竹|鲜|亓|是|畅|还|闾|万俟|上官|夏侯|闻人|赫连|羊舌|公羊|公冶|濮阳|单于|申屠|仲孙|令狐|宇文|慕容|闾丘|司空|司寇|呼延|颛孙|巫马|漆雕|壤驷|拓跋|宰父|段干|东郭|梁丘|东门|南宫|公仪|太史|叔孙|尔朱|相里|司城|雍门|贺兰|南郭";
    //男
    private static var MALE_JIAN:String = "舜|主|仁|仓|仞|伋|伸|佺|侪|俟|俣|倝|倧|储|僧|儒|伟|则|创|剑|劭|勘|叔|嗣|壮|守|宾|宗|宣|宰|峙|崇|川|巡|庚|才|拯|斋|晁|曹|珺|珹|琛|琮|瑎|璟|瑜|畴|矢|磊|碫|社|祚|禅|穆|竦|缜|舱|船|襦|辑|子|榜|葆|蒲|乐|钢|铖|铸|锋|键|馗|骏|骥|驾|诚|赐|端|坚|弓|彦|悍|攀|昂|健|凯|啸|木|森|骞|函|魁|鲛|鹰|乒|冕|备|宾|封|峰|彪|旁|明|昴|汉|汗|涛|清|浦|澎|濮|瀚|灏|虚|豹|辈|邶|部|雄|震|俯|颇|颔|飒|飚|亮|仝|儋|力|勒|哲|展|弛|弩|征|德|忠|振|掣|旻|昮|晟|朕|段|泰|炅|煜|炎|玄|君|黎|贤|金|辉|欧|友|问|安福|安国|安康|安民|安平|安顺|安晏|安怡|安志|昂雄|宾鸿|彬彬|彬郁|斌蔚|波光|波峻|博瀚|博达|博简|博容|博涉|博涛|博学|博延|博易|博远|才良|才英|才俊|成弘|成济|成龙|成双|成文|成益|成周|承弼|承恩|承基|承平|承天|承宣|承业|承允|承载|承志|德海|德华|德惠|德润|德水|德曜|德义|德佑|德元|德泽|飞昂|飞飙|飞尘|飞驰|飞翰|飞翮|飞虎|飞龙|飞鸣|飞扬|飞翔|飞翼|飞宇|飞雨|飞跃|飞舟|丰茂|刚豪|刚捷|高昂|高畅|高驰|高澹|高芬|高峰|高格|高翰|高洁|高朗|高邈|高明|高兴|高雅|高阳|高谊|高懿|高远|高卓|光华|光济|光亮|光明|光熙|光誉|国安|国源|冠玉|晗日|涵涤|涵忍|涵润|涵煦|涵衍|涵映|翰采|翰飞|翰翮|翰墨|翰音|翰藻|瀚漠|昊昊|昊乾|昊然|昊天|昊英|浩博|浩大|浩荡|浩广|浩瀚|浩慨|浩阔|浩淼|浩邈|浩然|浩壤|浩言|和蔼|和璧|和畅|和歌|和平|和惬|和硕|和泰|和通|和煦|和宜|和玉|和豫|和韵|和正|鹤轩|弘大|弘光|弘厚|弘济|弘亮|弘深|弘图|弘文|弘雅|弘业|弘益|弘懿|弘壮|宏博|宏畅|宏大|宏富|宏浚|宏旷|宏朗|宏邈|宏深|宏盛|宏硕|宏扬|宏逸|宏远|鸿宝|鸿博|鸿彩|鸿畴|鸿德|鸿风|鸿光|鸿朗|鸿熙|鸿禧|鸿轩|鸿煊|鸿羽|鸿云|鸿哲|鸿振|鸿卓|华采|华灿|华池|华皓|华辉|华美|华荣|嘉赐|嘉福|嘉茂|嘉慕|嘉年|嘉庆|嘉容|嘉胜|嘉实|嘉澍|嘉禧|嘉歆|嘉勋|嘉谊|嘉颖|嘉玉|嘉悦|嘉泽|嘉祯|嘉致|坚壁|坚成|建安|建柏|建弼|建华|建茗|建树|建修|建义|建章|健柏|锦程|晋鹏|经亘|经略|经纬|经业|经艺|景福|景辉|景龙|景山|景铄|景同|靖琪|君浩|俊拔|俊才|俊驰|俊达|俊发|俊豪|俊杰|俊郎|俊良|俊茂|俊民|俊明|俊能|俊爽|俊晤|俊贤|俊雅|俊逸|俊友|俊誉|俊哲|俊智|季萌|开畅|开宇|开霁|凯安|凯定|凯复|凯捷|凯康|凯旋|恺歌|康安|康成|康复|康乐|康平|康盛|康适|康泰|乐安|乐成|乐和|乐康|乐容|乐生|乐水|乐童|乐心|乐逸|乐音|乐游|乐悦|乐章|乐志|黎明|力强|力行|力言|立果|立辉|立群|良弼|良材|良畴|良翰|良骥|良骏|良平|理群|茂才|茂德|茂实|茂勋|敏博|敏达|敏学|明诚|明德|明杰|明朗|明旭|明轩|明哲|明知|明智|朋兴|彭勃|彭湃|彭魄|彭泽|鹏程|鹏飞|鹏海|鹏举|鹏鲲|鹏天|鹏云|濮存|璞玉|浦和|奇略|奇胜|奇思|奇伟|奇文|奇逸|奇志|祺福|祺祥|琪睿|荣轩|锐锋|锐进|锐立|锐思|锐意|锐泽|锐志|睿博|睿诚|睿聪|睿德|睿广|睿明|睿思|绍钧|绍元|圣杰|思聪|思源|思博|斯伯|泰和|泰鸿|泰宁|泰清|天材|天赋|天罡|天翰|天华|天空|天路|天睿|天佑|天元|天泽|同方|同光|同化|巍昂|巍奕|伟毅|伟诚|伟懋|伟彦|伟泽|伟志|温茂|温韦|温瑜|文昌|文德|文赋|文翰|文华|文乐|文敏|文山|文星|文宣|文曜|文斌|文滨|向笛|向明|向阳|翔飞|项明|心水|心远|欣嘉|欣然|欣怡|欣悦|新霁|新立|新知|信厚|信然|兴安|兴昌|兴德|兴国|兴平|兴生|兴腾|兴为|兴贤|兴学|兴业|星波|星驰|星海|星河|星晖|星剑|星阑|星文|星雨|星洲|修德|修洁|修筠|修能|修齐|修为|修文|修永|修真|修贤|炫明|学海|学民|学文|学真|雪峰|雅昶|雅达|雅健|雅逸|雅志|阳飙|阳冰|阳伯|阳德|阳晖|阳嘉|阳秋|阳舒|阳文|阳夏|阳煦|阳焱|阳羽|阳泽|烨赫|烨磊|烨然|烨伟|烨熠|毅然|逸明|宜春|宜年|宜人|意远|意致|熠彤|英飙|英才|英发|英光|英华|英朗|英睿|英韶|英武|英勋|英耀|英逸|英哲|英卓|英纵|永春|永昌|永丰|永嘉|永年|永寿|永望|永言|永元|咏德|咏思|勇男|勇捷|勇毅|宇航|宇文|雨伯|雨石|雨星|玉宸|玉龙|玉山|玉书|玉堂|玉宇|玉泽|元白|元化|元嘉|元驹|元恺|元良|元龙|元青|元纬|元勋|元忠|远航|苑杰|蕴涵|蕴藉|哲瀚|哲圣|振海|正诚|正德|正豪|正奇|正卿|正祥|正雅|正业|正真|志诚|志勇|志国|志尚|志文|志学|志义|志泽|智明|智勇|智志|子安|子民|子默|子平|子石|子真|子昂|子瑜|自强|自怡|曾琪|泽语";
    //女
    private static var FEMALE_JIAN:String = "倩|倰|偲|佳|仪|宜|奴|好|姗|姹|婵|姜|嫂|嫱|娇|嫣|婧|婉|姞|姲|娘|妹|妙|娆|娥|媱|婷|环|珊|玲|瑛|瑶|瑞|琦|琪|环|瑗|薇|芬|芯|茜|荷|莉|菊|萍|苹|草|芮|莎|菁|芸|茗|菲|英|蕾|颖|蔓|曼|淼|滢|洁|澜|淞|漩|涟|汇|冷|霜|霞|香|馥|秀|飘|滢|筠|竹|凝|欢|巧|静|翠|红|岚|兰|素|华|俪|呤|囡|彤|怜|月|晶|星|毓|璧|灵|慧|眉|凡|风|勤|雁|嘉|黛|情|梦|悦|宁|容|彤|影|音|纯|思|纤|舒|依|融|文|火|烁|煜|炅|冉|屏|宛|雨|安吉|安娜|安琪|安娴|荌荌|奥维|北辰|北晶|贝丽|蓓蕾|碧琳|碧玉|冰枫|冰蓝|冰彦|博丽|博雅|布侬|布衣|采莲|采文|彩静|彩妍|婵娟|畅然|朝旭|琛丽|晨曦|初然|楚楚|楚云|春华|春兰|春梅|春晓|春燕|春雨|淳美|慈心|聪睿|黛娥|丹红|丹溪|典丽|蝶梦|丁兰|端静|端敏|端懿|朵儿|恩霈|璠瑜|方雅|芳蔼|芳芳|芳馥|芳蕙|芳林|芳荃|芳润|芳懿|芳泽|飞雪|菲菲|斐斐|芬芬|丰熙|芙蓉|甘雨|高洁|歌云|格菲|葛菲|古香|谷雪|瑰玮|桂枫|桂月|海儿|含娇|含文|含秀|晗玥|涵菡|寒梅|好洁|浩岚|皓洁|合乐|合瑞|和静|和暖|和悌|和暄|和怡|和豫|河灵|荷紫|鹤梦|弘丽|弘懿|红旭|闳丽|虹英|虹影|虹玉|华楚|华婉|华芝|怀思|欢欣|会雯|彗云|惠美|惠心|慧君|慧美|慧秀|慧艳|慧颖|慧月|蕙兰|吉帆|吉敏|吉星|吉月|霁芸|佳美|佳文|佳悦|家欣|嘉宝|嘉丽|嘉禾|嘉歆|嘉怡|嘉音|嘉玉|嘉悦|江雪|姣丽|娇洁|皎洁|杰秀|洁雅|今歌|今雨|金枝|锦凡|锦文|瑾瑶|菁英|晶晶|晶滢|静安|静涵|静慧|静美|静恬|静娴|静雅|静云|菊月|娟丽|娟妍|隽洁|隽巧|君洁|君雅|筠心|俊慧|珺俐|珺琪|可可|可佳|可心|琨瑜|兰蕙|兰娜|兰英|兰泽|岚翠|岚岚|朗丽|朗然|乐容|乐欣|乐悦|丽芳|丽佳|丽思|丽雅|丽泽|林帆|琳芳|琳瑜|伶伶|灵慧|灵萱|灵韵|玲琳|玲珑|凌波|凌晓|铃语|菱华|令美|流丽|流婉|柳思|芦雪|洛妃|玛丽|曼丽|曼妮|曼容|曼文|曼语|曼珠|蔓菁|梅风|梅花|梅青|梅英|美华|美曼|萌阳|孟乐|孟阳|梦菲|梦华|梦露|梦秋|梦桐|梦雨|梦云|梦竹|米雪|密思|妙婧|妙思|妙意|妙珍|玟玉|闵雨|敏丽|敏思|明煦|鸣晨|茗雪|木兰|慕梅|慕思|暮雨|娜兰|乃心|囡囡|妮娜|霓云|念念|凝洁|凝然|凝心|凝雨|妞妞|暖暖|暖梦|沛若|沛文|佩杉|佩珍|彭丹|品韵|平惠|平良|平婉|平心|平莹|萍韵|齐心|奇文|颀秀|琦珍|启颜|绮丽|绮美|绮思|绮艳|绮云|千叶|芊芊|倩丽|倩秀|俏丽|琴心|琴雪|琴韵|卿云|清芬|清华|清霁|清宁|清绮|清润|清舒|清心|清雅|清一|清怡|清懿|清悦|清卓|情韵|晴虹|晴岚|晴美|晴霞|琼芳|琼岚|琼思|琼音|秋芳|秋露|秋彤|秋英|秋玉|秋芸|曲文|苒苒|任真|蓉城|融雪|柔惠|柔谨|柔丽|柔妙|柔婉|柔绚|如冰|如心|如雪|如意|茹薇|茹云|蕊珠|芮波|芮佳|芮澜|芮美|芮雅|芮悦|瑞锦|瑞绣|瑞芝|睿思|睿文|睿姿|若芳|若兰|若彤|若云|莎莎|三姗|森莉|沙羽|杉月|珊珊|善和|善思|韶丽|韶敏|韶阳|邵美|沈静|沈思|诗怀|诗蕾|诗蕊|施然|世敏|世韵|书桃|书萱|书艺|书语|抒怀|姝惠|姝美|淑华|淑慧|淑兰|淑然|淑贤|淑懿|淑贞|舒方|舒兰|舒扬|帅红|双玉|水悦|顺慈|丝柳|丝娜|丝琪|丝微|司辰|思嫒|思聪|思恩|思涵|思佳|思洁|思琳|思萌|思娜|思琪|思思|思溪|思怡|思懿|思莹|思语|斯琪|斯斯|斯雅|松雨|素华|素洁|素欣|洮洮|陶宁|陶宜|天慧|天籁|天睿|天欣|天媛|天韵|田田|恬静|恬谧|恬然|恬雅|甜恬|听然|婷美|婷婷|婷玉|彤彤|彤霞|桐华|童彤|童欣|宛畅|宛妙|莞然|婉静|婉娜|婉然|婉柔|婉秀|婉奕|菀菀|琬琰|望舒|微澜|微熹|薇歌|韦柔|苇然|玮琪|未央|文惠|文君|文敏|文姝|文心|文漪|雯华|问筠|问萍|西华|希恩|希蓉|惜文|惜玉|熙柔|熙阳|喜儿|霞飞|霞辉|霞姝|夏菡|夏岚|夏彤|夏璇|夏月|仙媛|闲华|闲丽|贤淑|娴静|娴婉|羡丽|献玉|香梅|香雪|湘灵|向晨|宵雨|萧曼|箫笛|小春|小谷|小琴|小星|小雨|晓凡|晓慧|晓莉|晓楠|晓桐|晓燕|笑雯|笑妍|心菱|心香|心怡|心远|忻欢|忻慕|忻忻|昕昕|欣畅|欣嘉|欣美|欣彤|欣欣|欣怡|欣悦|莘莘|新蕾|新梅|新苗|新文|新雅|新雨|新月|歆然|馨荣|馨香|杏儿|修美|秀华|秀杰|秀娟|秀筠|秀丽|秀梅|秀媚|秀妮|秀雅|秀逸|秀颖|秀越|绣文|琇芳|琇晶|琇云|萱彤|暄美|玄静|玄清|玄雅|璇娟|璇子|雪儿|雪枫|雪翎|雪曼|雪萍|雪艳|寻春|雅爱|雅唱|雅凡|雅惠|雅静|雅可|雅美|雅宁|雅琴|雅柔|雅韶|雅素|雅娴|雅艳|雅懿|雅韵|娅芳|娅玟|娅思|娅欣|妍芳|妍和|妍雅|芫华|言心|琰琬|彦慧|彦灵|彦杉|晏静|晏如|艳卉|燕桦|燕岚|燕妮|燕舞|阳霁|阳曦|杨柳|洋洋|瑶岑|野雪|叶春|叶帆|叶飞|叶吉|叶农|叶舞|晔晔|一禾|一瑾|一雯|依白|依美|依秋|依珊|依心|仪芳|宜春|宜楠|宜欣|怡和|怡乐|怡木|怡然|怡悦|颐然|以晴|以彤|以轩|倚云|忆梅|忆秋|忆彤|忆远|奕叶|轶丽|逸美|逸馨|逸雅|逸致|音华|音仪|音韵|银河|银瑶|饮月|胤雅|英慧|英秀|莺莺|莺韵|瑛瑶|璎玑|迎秋|莹白|莹洁|莹琇|莹玉|萦思|滢渟|颖初|颖然|颖秀|映波|映秋|雍恬|优乐|优悠|优悦|悠柔|悠婉|悠雅|悠逸|幼仪|余馥|愉婉|瑜蓓|瑜敏|瑜英|雨筠|雨燕|语冰|语诗|语心|玉琲|玉环|玉珂|玉轩|玉英|爰美|源源|媛女|月华|月灵|月杉|月天|月悦|悦畅|悦恺|悦来|悦人|悦心|悦宜|悦远|云淡|云岚|云梦|云水|云蔚|云霞|云英|韫素|韵流|韵宁|韵诗|蕴和|蕴秀|赞悦|泽惠|湛芳|昭懿|哲丽|哲思|贞芳|贞婉|贞韵|珍瑞|真如|真一|正平|正思|之桃|芝英|知慧|芷兰|芷若|致欣|智美|仲舒|珠星|珠雨|竹筱|竹雨|竹悦|庄静|庄雅|卓逸|子丹|子凡|子怀|子蕙|子美|子宁|子童|子欣|子璇|子亦|子珍|梓涵|梓菱|梓璐|梓敏|梓倩|梓珊|梓婷|梓童|梓欣|梓萱|梓莹|梓榆|梓云|紫琼|紫桐|紫玉|奇思";

    public static function rand(sex:int = 0):String {
        var surName:String = StaticConfig.platform == PlatformSDK.ORANGE ? SURNAME_JIAN : SURNAME;
        var surArr:Array = surName.split('|') as Array;

        var name:String = StaticConfig.platform == PlatformSDK.ORANGE ? (sex == 0 ? FEMALE_JIAN : MALE_JIAN) : (sex == 0 ? FEMALE : MALE);
        var nameArr:Array = name.split('|') as Array;

        var count:int = 0;
        var randomName:String = "蜀山传奇";
        while (count < 5) {
            var surIndex:int = Math.round(Math.random() * (surArr.length - 1));
            var nameIndex:int = Math.round(Math.random() * (nameArr.length - 1));
            randomName = surArr[surIndex] + nameArr[nameIndex];
            count++;
        }
        return randomName;
    }

    public static function randAll():String {
        var sex:int = Math.round(Math.random());
        return rand(sex);
    }

    //逻辑暂时这样处理
    public static function isIn(str:String, sex:int = 0):Boolean {
        var len:int = str.length;
        if (len > 3)return false;
        else if (len == 3) {
            return isInSurName(str[0] + str[1]) && isInName(str[2], sex);
        }
        else {
            return isInSurName(str[0]) && isInName(str[1], sex);
        }
        return false;
    }

    private static function isInSurName(str:String):Boolean {

        return SURNAME.indexOf(str) != -1;
    }

    private static function isInName(str:String, sex:int = 0):Boolean {
        var NAME:String = sex == 0 ? FEMALE : MALE;
        return NAME.indexOf(str) != -1;
    }

    public static function randOccu():int {
        return Math.round(Math.random() * 2);
    }
}
}
